# напишете функция, която приема лист с минимум три позитвни числа. Трябва да върнете трите най-големи числа в сортиран лист.
# НЯМАТЕ ПРАВО ДА СОРТИРАТЕ ЛИСТА, КОЙТО ПОДАВАТЕ НА ФУНКЦИЯТА. Може да връщате дублиращи се стойности.
# Примерен вход - [141, 1, 17, -7, -17, -27, 18, 541, 8, 7, 7]
# Очкаван изход = [18, 141, 541]


def max_three(arr: list):
    tmp_list = []
    for elements in range(3):
        num = max(arr)
        tmp_list.append(arr.pop(num))
        arr.remove(num)

    sort_list = sorted(tmp_list)
    return sort_list

print(max_three([141, 1, 17, -7, -17, -27, 18, 541, 8, 7, 7]))


