# 6) *Повишена трудност:
# Напишете функция, която приема лист с ints и връща лист с два индекса.
# Двата индекса трябва да бъдат началната и крайната точна на подгрупата числа, която трябва да бъде пренаредена в листа.
# НЯМА НУЖДА ДА ГИ ПРЕНАРЕЖДАТЕ, а само да кажете кое е парчето, което трябва да се пренареди.
# примерене вход: [1 ,2 , 4, 7, 10, 11, 7, 12, 6, 7, 16, 18, 19]
# примерен изход: [3, 9]
# обяснение: Всички числа от 3-ти индекс (първата седмица) до 9-ти индекс (втората седмица) трябва да бъдат


my_list = [1, 2, 4, 7, 10, 11, 7, 12, 6, 7, 16, 18, 19]
my_list1 = my_list.copy()
my_list1.sort()
firstIdx = 0
backIdx = 0
for idx in range(len(my_list)):
    if my_list[idx] != my_list1[idx]:
        firstIdx = idx
        break
for idx in range(len(my_list) - 1, -1, - 1):
    if my_list[idx] != my_list1[idx]:
        backIdx = idx
        break
print(firstIdx, backIdx)